In [1]:
a = 56

In [2]:
b = int(a)

In [3]:
print(b)

56

In [4]:
x = [1,2,3,4,5]

In [5]:
y = [2*x for x in x]

In [7]:
y

[2, 4, 6, 8, 10]

In [8]:
x = lambda x,y=3: x + y

In [11]:
print(x(1,100))

101

In [12]:
def name(x,y=4):
    return x + y

In [14]:
name(1,6)

7

In [15]:
name(2)

6

In [16]:
name(0)

4

In [17]:
name(,)

SyntaxError: invalid syntax (1214752708.py, line 1)

In [18]:
name(1,)

5

In [19]:
7%2

1

In [20]:
7/2

3.5

In [21]:
77/2

38.5

In [24]:
900**400

497741412293849219288146402972996167980251766964031433106975431741386319330058867296037894103879944423379720062974087627880942563843687429413721362365168308462354511580569441704819185689833557769033177009327115444202097768130543585643759048132149896251724867281306012368301180499209450549969175694632946623802925690831738765924589336186928548517977709901684701269855830935841217600100000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000

In [23]:
9**2

81

In [25]:
import math

In [26]:
print(math.sin(0))

0.0

In [27]:
print(math.cos(0))

1.0

In [28]:
print(math.cos(3.14))

-0.9999987317275395

In [29]:
print(math.pi)

3.141592653589793

In [30]:
print(math.cos(math.pi))

-1.0

In [31]:
name = ['Rajat', 'Rohit', 'Tanya']

age = [27, 29, 25]

In [32]:
import pandas as pd

In [42]:
df = pd.DataFrame({"name":name , "age":age})

In [43]:
df

    name  age
0  Rajat   27
1  Rohit   29
2  Tanya   25

In [44]:
dict_of_dict = {
    "birthyear": {"alice":1985, "bob": 1984, "charles": 1992},
    "hobby": {"alice":"Biking", "bob": "Dancing"},
    "weight": {"alice":68, "bob": 83, "charles": 112},
    "children": {"bob": 3, "charles": 0}
}
print(dict_of_dict)

{'birthyear': {'alice': 1985, 'bob': 1984, 'charles': 1992}, 'hobby': {'alice': 'Biking', 'bob': 'Dancing'}, 'weight': {'alice': 68, 'bob': 83, 'charles': 112}, 'children': {'bob': 3, 'charles': 0}}

In [45]:
df = pd.DataFrame(dict_of_dict)

In [46]:
df

         birthyear    hobby  weight  children
alice         1985   Biking      68       NaN
bob           1984  Dancing      83       3.0
charles       1992      NaN     112       0.0

In [47]:
df[["children","weight"]]

         children  weight
alice         NaN      68
bob           3.0      83
charles       0.0     112

In [50]:
df["children"]["charles"]

0.0

In [51]:
df["children"].value_counts()

3.0    1
0.0    1
Name: children, dtype: int64

In [52]:
df.children

alice      NaN
bob        3.0
charles    0.0
Name: children, dtype: float64

In [53]:
df.weight

alice       68
bob         83
charles    112
Name: weight, dtype: int64

In [54]:
df["weight"]

alice       68
bob         83
charles    112
Name: weight, dtype: int64

In [57]:
df.iloc[0,1]

'Biking'

In [58]:
df.columns

Index(['birthyear', 'hobby', 'weight', 'children'], dtype='object')

In [59]:
len(df.columns)

4

In [60]:
len(df)

3

In [61]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, alice to charles
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   birthyear  3 non-null      int64
 1   hobby      2 non-null      object
 2   weight     3 non-null      int64
 3   children   2 non-null      float64
dtypes: float64(1), int64(2), object(1)
memory usage: 228.0+ bytes

In [62]:
df.shape

(3, 4)

In [74]:
len(df["weight"].describe())

8

In [65]:
dict_of_dict = {
    "birthyear": {"alice":1985, "bob": 1985, "charles": 1992},
    "hobby": {"alice":"Biking", "bob": "Dancing"},
    "weight": {"alice":68, "bob": 83, "charles": 112},
    "children": {"bob": 3, "charles": 0}
}
print(dict_of_dict)

{'birthyear': {'alice': 1985, 'bob': 1985, 'charles': 1992}, 'hobby': {'alice': 'Biking', 'bob': 'Dancing'}, 'weight': {'alice': 68, 'bob': 83, 'charles': 112}, 'children': {'bob': 3, 'charles': 0}}

In [66]:
df = pd.DataFrame(dict_of_dict)

In [67]:
df

         birthyear    hobby  weight  children
alice         1985   Biking      68       NaN
bob           1985  Dancing      83       3.0
charles       1992      NaN     112       0.0

In [73]:
len(df['birthyear'].unique())

2

In [76]:
df["hobby"].isnull()

alice      False
bob        False
charles     True
Name: hobby, dtype: bool

In [77]:
df

         birthyear    hobby  weight  children
alice         1985   Biking      68       NaN
bob           1985  Dancing      83       3.0
charles       1992      NaN     112       0.0

In [79]:
df.loc[df["birthyear"] == 1992]

         birthyear hobby  weight  children
charles       1992   NaN     112       0.0

In [91]:
df.loc[df["hobby"].isnull()]

         birthyear hobby  weight  children
charles       1992   NaN     112       0.0

In [92]:
df.loc[df["hobby"].notnull()]

       birthyear    hobby  weight  children
alice       1985   Biking      68       NaN
bob         1985  Dancing      83       3.0

In [95]:
df.dropna(inplace = true)

NameError: name 'true' is not defined

In [96]:
df2 = df.dropna()

In [97]:
df2

     birthyear    hobby  weight  children
bob       1985  Dancing      83       3.0

In [98]:
df

         birthyear    hobby  weight  children
alice         1985   Biking      68       NaN
bob           1985  Dancing      83       3.0
charles       1992      NaN     112       0.0

In [101]:
df.sort_values("children", inplace = True)

In [102]:
df

         birthyear    hobby  weight  children
charles       1992      NaN     112       0.0
bob           1985  Dancing      83       3.0
alice         1985   Biking      68       NaN

In [103]:
df

         birthyear    hobby  weight  children
charles       1992      NaN     112       0.0
bob           1985  Dancing      83       3.0
alice         1985   Biking      68       NaN

In [109]:
df.sort_values("children", ascending = False, inplace = True)

In [110]:
df

         birthyear    hobby  weight  children
bob           1985  Dancing      83       3.0
charles       1992      NaN     112       0.0
alice         1985   Biking      68       NaN

In [111]:
df

         birthyear    hobby  weight  children
bob           1985  Dancing      83       3.0
charles       1992      NaN     112       0.0
alice         1985   Biking      68       NaN

In [112]:
df.sort_values("children")

         birthyear    hobby  weight  children
charles       1992      NaN     112       0.0
bob           1985  Dancing      83       3.0
alice         1985   Biking      68       NaN

In [113]:
df

         birthyear    hobby  weight  children
bob           1985  Dancing      83       3.0
charles       1992      NaN     112       0.0
alice         1985   Biking      68       NaN

In [114]:
df.sort_values("children", inplace = True)

In [115]:
df

         birthyear    hobby  weight  children
charles       1992      NaN     112       0.0
bob           1985  Dancing      83       3.0
alice         1985   Biking      68       NaN

In [119]:
df.drop(["birthyear"], axis = 1, inplace = True)

In [120]:
df

           hobby  weight  children
charles      NaN     112       0.0
bob      Dancing      83       3.0
alice     Biking      68       NaN

In [121]:
df

           hobby  weight  children
charles      NaN     112       0.0
bob      Dancing      83       3.0
alice     Biking      68       NaN

In [126]:
df.drop(["alice"], axis =0, inplace = True)

In [127]:
df

           hobby  weight  children
charles      NaN     112       0.0
bob      Dancing      83       3.0

In [128]:
df

           hobby  weight  children
charles      NaN     112       0.0
bob      Dancing      83       3.0

In [129]:
df.rename({"hobby":"hobbies", "weight":"weights" , "children":"childrens" },axis = 1, inplace = True)

In [130]:
df

         hobbies  weights  childrens
charles      NaN      112        0.0
bob      Dancing       83        3.0

In [131]:
df = pd.DataFrame(dict_of_dict)

In [132]:
df

         birthyear    hobby  weight  children
alice         1985   Biking      68       NaN
bob           1985  Dancing      83       3.0
charles       1992      NaN     112       0.0

In [133]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, alice to charles
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   birthyear  3 non-null      int64
 1   hobby      2 non-null      object
 2   weight     3 non-null      int64
 3   children   2 non-null      float64
dtypes: float64(1), int64(2), object(1)
memory usage: 120.0+ bytes

In [135]:
df["weight"] = df["weight"].astype(str)

In [136]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, alice to charles
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   birthyear  3 non-null      int64
 1   hobby      2 non-null      object
 2   weight     3 non-null      object
 3   children   2 non-null      float64
dtypes: float64(1), int64(1), object(2)
memory usage: 120.0+ bytes

In [137]:
df["weight"]

alice       68
bob         83
charles    112
Name: weight, dtype: object

In [138]:
df.loc[df["weight"]>70]

TypeError: '>' not supported between instances of 'str' and 'int'

In [139]:
df["weight"] = df["weight"].astype(int)

In [142]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, alice to charles
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   birthyear  3 non-null      int64
 1   hobby      2 non-null      object
 2   weight     3 non-null      int64
 3   children   2 non-null      float64
dtypes: float64(1), int64(2), object(1)
memory usage: 228.0+ bytes

In [141]:
df.loc[df["weight"]>70]

         birthyear    hobby  weight  children
bob           1985  Dancing      83       3.0
charles       1992      NaN     112       0.0

In [143]:
df

         birthyear    hobby  weight  children
alice         1985   Biking      68       NaN
bob           1985  Dancing      83       3.0
charles       1992      NaN     112       0.0

In [144]:
df.drop(["birthyear"], axis =1)

           hobby  weight  children
alice     Biking      68       NaN
bob      Dancing      83       3.0
charles      NaN     112       0.0

In [145]:
df

         birthyear    hobby  weight  children
alice         1985   Biking      68       NaN
bob           1985  Dancing      83       3.0
charles       1992      NaN     112       0.0

In [146]:
df

         birthyear    hobby  weight  children
alice         1985   Biking      68       NaN
bob           1985  Dancing      83       3.0
charles       1992      NaN     112       0.0

In [147]:
def age_cal(a):
    return 2022-a

In [151]:
df["age"] = df.apply(lambda row:age_cal(row["birthyear"]),axis =1)

In [152]:
df

         birthyear    hobby  weight  children  age
alice         1985   Biking      68       NaN   37
bob           1985  Dancing      83       3.0   37
charles       1992      NaN     112       0.0   30

In [153]:
df

         birthyear    hobby  weight  children  age
alice         1985   Biking      68       NaN   37
bob           1985  Dancing      83       3.0   37
charles       1992      NaN     112       0.0   30

In [154]:
df.drop(["age"], axis = 1, inplace = True)

In [155]:
df

         birthyear    hobby  weight  children
alice         1985   Biking      68       NaN
bob           1985  Dancing      83       3.0
charles       1992      NaN     112       0.0

In [158]:
df["age"] = 2022 - df["birthyear"]

In [159]:
df

         birthyear    hobby  weight  children  age
alice         1985   Biking      68       NaN   37
bob           1985  Dancing      83       3.0   37
charles       1992      NaN     112       0.0   30

In [160]:
df.drop(["birthyear"], axis = 1 , inplace = True)

In [161]:
df

           hobby  weight  children  age
alice     Biking      68       NaN   37
bob      Dancing      83       3.0   37
charles      NaN     112       0.0   30

In [162]:
df.notnull()

         hobby  weight  children   age
alice     True    True     False  True
bob       True    True      True  True
charles  False    True      True  True

In [168]:
df2 = df.loc[df.notnull()].copy()

ValueError: Cannot index with multidimensional key

In [166]:
df2

         hobby  weight  children   age
alice     True    True     False  True
bob       True    True      True  True
charles  False    True      True  True

In [169]:
df.notnull()

         hobby  weight  children   age
alice     True    True     False  True
bob       True    True      True  True
charles  False    True      True  True

In [170]:
df

           hobby  weight  children  age
alice     Biking      68       NaN   37
bob      Dancing      83       3.0   37
charles      NaN     112       0.0   30

In [171]:
df2 = df.loc[df["children"].notnull()].copy()

In [172]:
df2

           hobby  weight  children  age
bob      Dancing      83       3.0   37
charles      NaN     112       0.0   30

In [173]:
df

           hobby  weight  children  age
alice     Biking      68       NaN   37
bob      Dancing      83       3.0   37
charles      NaN     112       0.0   30

In [174]:
df["weight"].mean()

87.66666666666667

In [175]:
df

           hobby  weight  children  age
alice     Biking      68       NaN   37
bob      Dancing      83       3.0   37
charles      NaN     112       0.0   30

In [183]:
df3 = df.groupby("age").size().reset_index()

In [181]:
df2 = df.groupby("age")["weight"].mean().reset_index()

In [182]:
df2

   age  weight
0   30   112.0
1   37    75.5

In [184]:
df3

   age  0
0   30  1
1   37  2

In [187]:
df3.rename({0:"Count"}, axis = 1, inplace = True)

In [188]:
df3

   age  Count
0   30      1
1   37      2

In [189]:
df

           hobby  weight  children  age
alice     Biking      68       NaN   37
bob      Dancing      83       3.0   37
charles      NaN     112       0.0   30

In [191]:
df.groupby("age")["weight"].agg({"mean","max","min"}).reset_index()

   age  max  min   mean
0   30  112  112  112.0
1   37   83   68   75.5